# tree_b에 존재하는 간선 하나를 삭제하고 새로운 간선 하나를 추가합니다.
# tree_b에 존재하는 두 정점의 번호를 바꿉니다.
# 1번 작업은 무제한으로 할 수 있지만 2번 작업은 최대 m번까지 밖에 할 수 없습니다.

def solution(a, b, m):
    answer = 0

    return answer

answer1 = solution([[1, 2], [2, 3]], [[1, 3], [3, 2]], 1)
print(answer1)

# answer2 = solution([[1, 2], [3, 1], [2, 4], [3, 5]], [[2, 1], [4, 1], [2, 5], [3, 2]], 1)
# print(answer2)

# answer3 = solution([[3, 4], [7, 2], [5, 4], [2, 3], [6, 5], [1, 2]], [[2, 1], [3, 6], [1, 4], [1, 5], [7, 1], [3, 2]], 2)
# print(answer3)